TheMrPhantom/ZeitmessanlageV2/timepanel-hub75/sdkconfig.defaults
# ESP32-S3 HUB75 time panel defaults.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

CONFIG_TIMEPANEL_PANEL_WIDTH=64
CONFIG_TIMEPANEL_PANEL_HEIGHT=32
CONFIG_TIMEPANEL_MATRIX_CHAIN_WIDTH=4
CONFIG_TIMEPANEL_MATRIX_CHAIN_HEIGHT=1
CONFIG_TIMEPANEL_PANEL_BRIGHTNESS=50
CONFIG_TIMEPANEL_BUTTON_GPIO=0
CONFIG_TIMEPANEL_PARCOURS_SECONDS=30
CONFIG_TIMEPANEL_PARCOURS_INTRO_SECONDS=5
CONFIG_TIMEPANEL_SENSOR_ENABLED=y
CONFIG_TIMEPANEL_SENSOR_I2C_PORT=0
CONFIG_TIMEPANEL_SENSOR_I2C_SDA_GPIO=35
CONFIG_TIMEPANEL_SENSOR_I2C_SCL_GPIO=36
CONFIG_TIMEPANEL_SENSOR_I2C_FREQUENCY_HZ=400000
# CONFIG_TIMEPANEL_SENSOR_I2C_INTERNAL_PULLUPS is not set
CONFIG_TIMEPANEL_SENSOR_LOG_INTERVAL_SECONDS=10

CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_CANVAS=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
